CASE_L/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    sideX
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    sideZ
    {
        type            symmetry;
    }


    lowerWall
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    topWall
    {
        type            prghTotalPressure;
        p0              uniform 0;
    }

    wall
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
}

// ************************************************************************* //
