CASE_L/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   .001;

vertices
(
    (0 0 0)     //0
    (15 0 0)    //1
    (15 50 0)   //2
    (0 50 0)    //3
    (0 0 0.1)   //4
    (15 0 0.1)  //5
    (15 50 0.1) //6
    (0 50 0.1)  //7
    (15.5 0 0) //8
    (30.5 0 0)    //9
    (30.5 50 0)   //10
    (15.5 50 0)    //11
    (15.5 0 0.1)   //12
    (30.5 0 0.1)  //13
    (30.5 50 0.1) //14
    (15.5 50 0.1)  //15
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (150 500 1) simpleGrading (1 1 1)
    hex (1 8 11 2 5 12 15 6) (5 500 1) simpleGrading (1 1 1) 
    hex (8 9 10 11 12 13 14 15) (150 500 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    leftWall
    {
        type wall;
        faces
        (
            (0 4 7 3) 
        );
    }
    rightWall
    {
        type wall;
        faces
        (
            (9 10 14 13) 
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (4 0 1 5)
            (12 8 9 13) 
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (2 6 15 11)
            (11 15 14 10)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (1 2 11 8)
            (8 11 10 9)
            (4 5 6 7)
            (5 12 15 6)
            (12 13 14 15)
        );
    }
    bubbleIn
    {
        type patch;
        faces
        (
            (5 1 8 12)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
